Revit 2027 API
Alignment.Get(Document, Guid) Method
 Returns an Alignment in the document given its GUID.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Alignment Get(
	Document document,
	Guid guid
)
Public Shared Function Get (
	document As Document,
	guid As Guid
) As Alignment
public:
static Alignment^ Get(
	Document^ document,
	Guid guid
)
static member Get :
        document : Document *
        guid : Guid -> Alignment
Parameters
document Document
The document for which the alignment is returned.
guid Guid
The unique identifier of the Alignment.
Return Value
Alignment
See Also
Reference
Alignment Class
Get Overload
Autodesk.Revit.DB.Infrastructure Namespace